{
	"format": "layers-model",
	"generatedBy": "keras v2.15.0",
	"convertedBy": "TensorFlow.js Converter v4.19.0",
	"modelTopology": {
		"keras_version": "2.15.0",
		"backend": "tensorflow",
		"model_config": {
			"class_name": "Sequential",
			"config": {
				"name": "sequential",
				"layers": [
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [null, 20],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "embedding_input"
						}
					},
					{
						"class_name": "Embedding",
						"config": {
							"name": "embedding",
							"trainable": true,
							"dtype": "float32",
							"batch_input_shape": [null, 20],
							"input_dim": 300,
							"output_dim": 32,
							"embeddings_initializer": {
								"module": "keras.initializers",
								"class_name": "RandomUniform",
								"config": { "minval": -0.05, "maxval": 0.05, "seed": null },
								"registered_name": null
							},
							"embeddings_regularizer": null,
							"activity_regularizer": null,
							"embeddings_constraint": null,
							"mask_zero": false,
							"input_length": 20
						}
					},
					{
						"class_name": "Conv1D",
						"config": {
							"name": "conv1d",
							"trainable": true,
							"dtype": "float32",
							"filters": 8,
							"kernel_size": [8],
							"strides": [1],
							"padding": "valid",
							"data_format": "channels_last",
							"dilation_rate": [1],
							"groups": 1,
							"activation": "relu",
							"use_bias": true,
							"kernel_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": { "seed": null },
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "GlobalMaxPooling1D",
						"config": {
							"name": "global_max_pooling1d",
							"trainable": true,
							"dtype": "float32",
							"data_format": "channels_last",
							"keepdims": false
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense",
							"trainable": true,
							"dtype": "float32",
							"units": 16,
							"activation": "relu",
							"use_bias": true,
							"kernel_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": { "seed": null },
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_1",
							"trainable": true,
							"dtype": "float32",
							"units": 14,
							"activation": "softmax",
							"use_bias": true,
							"kernel_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": { "seed": null },
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						}
					}
				]
			}
		},
		"training_config": {
			"loss": {
				"class_name": "SparseCategoricalCrossentropy",
				"config": {
					"reduction": "auto",
					"name": "sparse_categorical_crossentropy",
					"from_logits": false,
					"ignore_class": null,
					"fn": "sparse_categorical_crossentropy"
				}
			},
			"metrics": [
				[
					{
						"class_name": "MeanMetricWrapper",
						"config": { "name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy" }
					}
				]
			],
			"weighted_metrics": null,
			"loss_weights": null,
			"optimizer_config": {
				"class_name": "Custom>Adam",
				"config": {
					"name": "Adam",
					"weight_decay": null,
					"clipnorm": null,
					"global_clipnorm": null,
					"clipvalue": null,
					"use_ema": false,
					"ema_momentum": 0.99,
					"ema_overwrite_frequency": null,
					"jit_compile": true,
					"is_legacy_optimizer": false,
					"learning_rate": 0.0010000000474974513,
					"beta_1": 0.9,
					"beta_2": 0.999,
					"epsilon": 1e-7,
					"amsgrad": false
				}
			}
		}
	},
	"weightsManifest": [
		{
			"paths": ["group1-shard1of1.bin"],
			"weights": [
				{ "name": "conv1d/kernel", "shape": [8, 32, 8], "dtype": "float32" },
				{ "name": "conv1d/bias", "shape": [8], "dtype": "float32" },
				{ "name": "dense/kernel", "shape": [8, 16], "dtype": "float32" },
				{ "name": "dense/bias", "shape": [16], "dtype": "float32" },
				{ "name": "dense_1/kernel", "shape": [16, 14], "dtype": "float32" },
				{ "name": "dense_1/bias", "shape": [14], "dtype": "float32" },
				{ "name": "embedding/embeddings", "shape": [300, 32], "dtype": "float32" }
			]
		}
	]
}
